Revit 2024 API
IndependentTag.GetLeaderElbow Method
 Returns the position of the elbow of the tag's leader that points to specified reference. Position of leader's elbow.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public XYZ GetLeaderElbow(
	Reference referenceTagged
)
Visual Basic
Public Function GetLeaderElbow ( _
	referenceTagged As Reference _
) As XYZ
Visual C++
public:
XYZ^ GetLeaderElbow(
	Reference^ referenceTagged
)
Parameters
referenceTagged
Type: Autodesk.Revit.DB.Reference
 The reference which is tagged.
Remarks
 Straight leaders do not have elbow points.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The specified reference does not have a leader or its leader is straight. -or- The specified reference is not currently tagged.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The IndependentTag object does not have a tag behavior.
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace